tests/loadtest/results/20260617_104413_capacity_base_k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /tests/ecg_scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 30m30s max duration (incl. graceful stop):
              * ecg: 50 iterations shared among 3 VUs (maxDuration: 30m0s, gracefulStop: 30s)


Run    [ 100% ] setup()
ecg    [   0% ]

running (00m02.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m00.5s/30m0s  00/50 shared iters

running (00m03.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m01.5s/30m0s  00/50 shared iters

running (00m04.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m02.5s/30m0s  00/50 shared iters

running (00m05.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m03.5s/30m0s  00/50 shared iters

running (00m06.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m04.5s/30m0s  00/50 shared iters

running (00m07.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m05.5s/30m0s  00/50 shared iters

running (00m08.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m06.5s/30m0s  00/50 shared iters

running (00m09.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m07.5s/30m0s  00/50 shared iters

running (00m10.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m08.5s/30m0s  00/50 shared iters

running (00m11.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
ecg    [   0% ] 3 VUs  00m09.5s/30m0s  00/50 shared iters

running (00m12.0s), 3/3 VUs, 1 complete and 0 interrupted iterations
ecg    [   2% ] 3 VUs  00m10.5s/30m0s  01/50 shared iters

running (00m13.0s), 3/3 VUs, 1 complete and 0 interrupted iterations
ecg    [   2% ] 3 VUs  00m11.5s/30m0s  01/50 shared iters

running (00m14.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m12.5s/30m0s  02/50 shared iters

running (00m15.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m13.5s/30m0s  02/50 shared iters

running (00m16.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m14.5s/30m0s  02/50 shared iters

running (00m17.0s), 3/3 VUs, 2 complete and 0 interrupted iterations
ecg    [   4% ] 3 VUs  00m15.5s/30m0s  02/50 shared iters

running (00m18.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
ecg    [   6% ] 3 VUs  00m16.5s/30m0s  03/50 shared iters

running (00m19.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
ecg    [   6% ] 3 VUs  00m17.5s/30m0s  03/50 shared iters

running (00m20.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
ecg    [   6% ] 3 VUs  00m18.5s/30m0s  03/50 shared iters

running (00m21.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
ecg    [   6% ] 3 VUs  00m19.5s/30m0s  03/50 shared iters

running (00m22.0s), 3/3 VUs, 4 complete and 0 interrupted iterations
ecg    [   8% ] 3 VUs  00m20.5s/30m0s  04/50 shared iters

running (00m23.0s), 3/3 VUs, 4 complete and 0 interrupted iterations
ecg    [   8% ] 3 VUs  00m21.5s/30m0s  04/50 shared iters

running (00m24.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m22.5s/30m0s  05/50 shared iters

running (00m25.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m23.5s/30m0s  05/50 shared iters

running (00m26.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m24.5s/30m0s  05/50 shared iters

running (00m27.0s), 3/3 VUs, 5 complete and 0 interrupted iterations
ecg    [  10% ] 3 VUs  00m25.5s/30m0s  05/50 shared iters

running (00m28.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
ecg    [  12% ] 3 VUs  00m26.5s/30m0s  06/50 shared iters

running (00m29.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
ecg    [  12% ] 3 VUs  00m27.5s/30m0s  06/50 shared iters

running (00m30.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
ecg    [  12% ] 3 VUs  00m28.5s/30m0s  06/50 shared iters

running (00m31.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
ecg    [  12% ] 3 VUs  00m29.5s/30m0s  06/50 shared iters

running (00m32.0s), 3/3 VUs, 7 complete and 0 interrupted iterations
ecg    [  14% ] 3 VUs  00m30.5s/30m0s  07/50 shared iters

running (00m33.0s), 3/3 VUs, 7 complete and 0 interrupted iterations
ecg    [  14% ] 3 VUs  00m31.5s/30m0s  07/50 shared iters

running (00m34.0s), 3/3 VUs, 8 complete and 0 interrupted iterations
ecg    [  16% ] 3 VUs  00m32.5s/30m0s  08/50 shared iters

running (00m35.0s), 3/3 VUs, 8 complete and 0 interrupted iterations
ecg    [  16% ] 3 VUs  00m33.5s/30m0s  08/50 shared iters

running (00m36.0s), 3/3 VUs, 8 complete and 0 interrupted iterations
ecg    [  16% ] 3 VUs  00m34.5s/30m0s  08/50 shared iters

running (00m37.0s), 3/3 VUs, 8 complete and 0 interrupted iterations
ecg    [  16% ] 3 VUs  00m35.5s/30m0s  08/50 shared iters

running (00m38.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
ecg    [  18% ] 3 VUs  00m36.5s/30m0s  09/50 shared iters

running (00m39.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
ecg    [  18% ] 3 VUs  00m37.5s/30m0s  09/50 shared iters

running (00m40.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
ecg    [  18% ] 3 VUs  00m38.5s/30m0s  09/50 shared iters

running (00m41.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
ecg    [  18% ] 3 VUs  00m39.5s/30m0s  09/50 shared iters

running (00m42.0s), 3/3 VUs, 10 complete and 0 interrupted iterations
ecg    [  20% ] 3 VUs  00m40.5s/30m0s  10/50 shared iters

running (00m43.0s), 3/3 VUs, 10 complete and 0 interrupted iterations
ecg    [  20% ] 3 VUs  00m41.5s/30m0s  10/50 shared iters

running (00m44.0s), 3/3 VUs, 11 complete and 0 interrupted iterations
ecg    [  22% ] 3 VUs  00m42.5s/30m0s  11/50 shared iters

running (00m45.0s), 3/3 VUs, 11 complete and 0 interrupted iterations
ecg    [  22% ] 3 VUs  00m43.5s/30m0s  11/50 shared iters

running (00m46.0s), 3/3 VUs, 11 complete and 0 interrupted iterations
ecg    [  22% ] 3 VUs  00m44.5s/30m0s  11/50 shared iters

running (00m47.0s), 3/3 VUs, 11 complete and 0 interrupted iterations
ecg    [  22% ] 3 VUs  00m45.5s/30m0s  11/50 shared iters

running (00m48.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
ecg    [  24% ] 3 VUs  00m46.5s/30m0s  12/50 shared iters

running (00m49.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
ecg    [  24% ] 3 VUs  00m47.5s/30m0s  12/50 shared iters

running (00m50.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
ecg    [  24% ] 3 VUs  00m48.5s/30m0s  12/50 shared iters

running (00m51.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
ecg    [  24% ] 3 VUs  00m49.5s/30m0s  12/50 shared iters

running (00m52.0s), 3/3 VUs, 13 complete and 0 interrupted iterations
ecg    [  26% ] 3 VUs  00m50.5s/30m0s  13/50 shared iters

running (00m53.0s), 3/3 VUs, 13 complete and 0 interrupted iterations
ecg    [  26% ] 3 VUs  00m51.5s/30m0s  13/50 shared iters

running (00m54.0s), 3/3 VUs, 13 complete and 0 interrupted iterations
ecg    [  26% ] 3 VUs  00m52.5s/30m0s  13/50 shared iters

running (00m55.0s), 3/3 VUs, 13 complete and 0 interrupted iterations
ecg    [  26% ] 3 VUs  00m53.5s/30m0s  13/50 shared iters

running (00m56.0s), 3/3 VUs, 14 complete and 0 interrupted iterations
ecg    [  28% ] 3 VUs  00m54.5s/30m0s  14/50 shared iters

running (00m57.0s), 3/3 VUs, 14 complete and 0 interrupted iterations
ecg    [  28% ] 3 VUs  00m55.5s/30m0s  14/50 shared iters

running (00m58.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
ecg    [  30% ] 3 VUs  00m56.5s/30m0s  15/50 shared iters

running (00m59.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
ecg    [  30% ] 3 VUs  00m57.5s/30m0s  15/50 shared iters

running (01m00.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
ecg    [  30% ] 3 VUs  00m58.5s/30m0s  15/50 shared iters

running (01m01.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
ecg    [  30% ] 3 VUs  00m59.5s/30m0s  15/50 shared iters

running (01m02.0s), 3/3 VUs, 16 complete and 0 interrupted iterations
ecg    [  32% ] 3 VUs  01m00.5s/30m0s  16/50 shared iters

running (01m03.0s), 3/3 VUs, 16 complete and 0 interrupted iterations
ecg    [  32% ] 3 VUs  01m01.5s/30m0s  16/50 shared iters

running (01m04.0s), 3/3 VUs, 16 complete and 0 interrupted iterations
ecg    [  32% ] 3 VUs  01m02.5s/30m0s  16/50 shared iters

running (01m05.0s), 3/3 VUs, 16 complete and 0 interrupted iterations
ecg    [  32% ] 3 VUs  01m03.5s/30m0s  16/50 shared iters

running (01m06.0s), 3/3 VUs, 17 complete and 0 interrupted iterations
ecg    [  34% ] 3 VUs  01m04.5s/30m0s  17/50 shared iters

running (01m07.0s), 3/3 VUs, 17 complete and 0 interrupted iterations
ecg    [  34% ] 3 VUs  01m05.5s/30m0s  17/50 shared iters

running (01m08.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
ecg    [  36% ] 3 VUs  01m06.5s/30m0s  18/50 shared iters

running (01m09.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
ecg    [  36% ] 3 VUs  01m07.5s/30m0s  18/50 shared iters

running (01m10.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
ecg    [  36% ] 3 VUs  01m08.5s/30m0s  18/50 shared iters

running (01m11.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
ecg    [  36% ] 3 VUs  01m09.5s/30m0s  18/50 shared iters

running (01m12.0s), 3/3 VUs, 19 complete and 0 interrupted iterations
ecg    [  38% ] 3 VUs  01m10.5s/30m0s  19/50 shared iters

running (01m13.0s), 3/3 VUs, 19 complete and 0 interrupted iterations
ecg    [  38% ] 3 VUs  01m11.5s/30m0s  19/50 shared iters

running (01m14.0s), 3/3 VUs, 19 complete and 0 interrupted iterations
ecg    [  38% ] 3 VUs  01m12.5s/30m0s  19/50 shared iters

running (01m15.0s), 3/3 VUs, 19 complete and 0 interrupted iterations
ecg    [  38% ] 3 VUs  01m13.5s/30m0s  19/50 shared iters

running (01m16.0s), 3/3 VUs, 20 complete and 0 interrupted iterations
ecg    [  40% ] 3 VUs  01m14.5s/30m0s  20/50 shared iters

running (01m17.0s), 3/3 VUs, 20 complete and 0 interrupted iterations
ecg    [  40% ] 3 VUs  01m15.5s/30m0s  20/50 shared iters

running (01m18.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
ecg    [  42% ] 3 VUs  01m16.5s/30m0s  21/50 shared iters

running (01m19.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
ecg    [  42% ] 3 VUs  01m17.5s/30m0s  21/50 shared iters

running (01m20.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
ecg    [  42% ] 3 VUs  01m18.5s/30m0s  21/50 shared iters

running (01m21.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
ecg    [  42% ] 3 VUs  01m19.5s/30m0s  21/50 shared iters

running (01m22.0s), 3/3 VUs, 22 complete and 0 interrupted iterations
ecg    [  44% ] 3 VUs  01m20.5s/30m0s  22/50 shared iters

running (01m23.0s), 3/3 VUs, 22 complete and 0 interrupted iterations
ecg    [  44% ] 3 VUs  01m21.5s/30m0s  22/50 shared iters

running (01m24.0s), 3/3 VUs, 22 complete and 0 interrupted iterations
ecg    [  44% ] 3 VUs  01m22.5s/30m0s  22/50 shared iters

running (01m25.0s), 3/3 VUs, 22 complete and 0 interrupted iterations
ecg    [  44% ] 3 VUs  01m23.5s/30m0s  22/50 shared iters

running (01m26.0s), 3/3 VUs, 23 complete and 0 interrupted iterations
ecg    [  46% ] 3 VUs  01m24.5s/30m0s  23/50 shared iters

running (01m27.0s), 3/3 VUs, 23 complete and 0 interrupted iterations
ecg    [  46% ] 3 VUs  01m25.5s/30m0s  23/50 shared iters

running (01m28.0s), 3/3 VUs, 23 complete and 0 interrupted iterations
ecg    [  46% ] 3 VUs  01m26.5s/30m0s  23/50 shared iters

running (01m29.0s), 3/3 VUs, 23 complete and 0 interrupted iterations
ecg    [  46% ] 3 VUs  01m27.5s/30m0s  23/50 shared iters

running (01m30.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
ecg    [  48% ] 3 VUs  01m28.5s/30m0s  24/50 shared iters

running (01m31.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
ecg    [  48% ] 3 VUs  01m29.5s/30m0s  24/50 shared iters

running (01m32.0s), 3/3 VUs, 25 complete and 0 interrupted iterations
ecg    [  50% ] 3 VUs  01m30.5s/30m0s  25/50 shared iters

running (01m33.0s), 3/3 VUs, 25 complete and 0 interrupted iterations
ecg    [  50% ] 3 VUs  01m31.5s/30m0s  25/50 shared iters

running (01m34.0s), 3/3 VUs, 25 complete and 0 interrupted iterations
ecg    [  50% ] 3 VUs  01m32.5s/30m0s  25/50 shared iters

running (01m35.0s), 3/3 VUs, 25 complete and 0 interrupted iterations
ecg    [  50% ] 3 VUs  01m33.5s/30m0s  25/50 shared iters

running (01m36.0s), 3/3 VUs, 26 complete and 0 interrupted iterations
ecg    [  52% ] 3 VUs  01m34.5s/30m0s  26/50 shared iters

running (01m37.0s), 3/3 VUs, 26 complete and 0 interrupted iterations
ecg    [  52% ] 3 VUs  01m35.5s/30m0s  26/50 shared iters

running (01m38.0s), 3/3 VUs, 26 complete and 0 interrupted iterations
ecg    [  52% ] 3 VUs  01m36.5s/30m0s  26/50 shared iters

running (01m39.0s), 3/3 VUs, 26 complete and 0 interrupted iterations
ecg    [  52% ] 3 VUs  01m37.5s/30m0s  26/50 shared iters

running (01m40.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
ecg    [  54% ] 3 VUs  01m38.5s/30m0s  27/50 shared iters

running (01m41.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
ecg    [  54% ] 3 VUs  01m39.5s/30m0s  27/50 shared iters

running (01m42.0s), 3/3 VUs, 28 complete and 0 interrupted iterations
ecg    [  56% ] 3 VUs  01m40.5s/30m0s  28/50 shared iters

running (01m43.0s), 3/3 VUs, 28 complete and 0 interrupted iterations
ecg    [  56% ] 3 VUs  01m41.5s/30m0s  28/50 shared iters

running (01m44.0s), 3/3 VUs, 28 complete and 0 interrupted iterations
ecg    [  56% ] 3 VUs  01m42.5s/30m0s  28/50 shared iters

running (01m45.0s), 3/3 VUs, 28 complete and 0 interrupted iterations
ecg    [  56% ] 3 VUs  01m43.5s/30m0s  28/50 shared iters

running (01m46.0s), 3/3 VUs, 29 complete and 0 interrupted iterations
ecg    [  58% ] 3 VUs  01m44.5s/30m0s  29/50 shared iters

running (01m47.0s), 3/3 VUs, 29 complete and 0 interrupted iterations
ecg    [  58% ] 3 VUs  01m45.5s/30m0s  29/50 shared iters

running (01m48.0s), 3/3 VUs, 29 complete and 0 interrupted iterations
ecg    [  58% ] 3 VUs  01m46.5s/30m0s  29/50 shared iters

running (01m49.0s), 3/3 VUs, 29 complete and 0 interrupted iterations
ecg    [  58% ] 3 VUs  01m47.5s/30m0s  29/50 shared iters

running (01m50.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
ecg    [  60% ] 3 VUs  01m48.5s/30m0s  30/50 shared iters

running (01m51.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
ecg    [  60% ] 3 VUs  01m49.5s/30m0s  30/50 shared iters

running (01m52.0s), 3/3 VUs, 31 complete and 0 interrupted iterations
ecg    [  62% ] 3 VUs  01m50.5s/30m0s  31/50 shared iters

running (01m53.0s), 3/3 VUs, 31 complete and 0 interrupted iterations
ecg    [  62% ] 3 VUs  01m51.5s/30m0s  31/50 shared iters

running (01m54.0s), 3/3 VUs, 31 complete and 0 interrupted iterations
ecg    [  62% ] 3 VUs  01m52.5s/30m0s  31/50 shared iters

running (01m55.0s), 3/3 VUs, 31 complete and 0 interrupted iterations
ecg    [  62% ] 3 VUs  01m53.5s/30m0s  31/50 shared iters

running (01m56.0s), 3/3 VUs, 32 complete and 0 interrupted iterations
ecg    [  64% ] 3 VUs  01m54.5s/30m0s  32/50 shared iters

running (01m57.0s), 3/3 VUs, 32 complete and 0 interrupted iterations
ecg    [  64% ] 3 VUs  01m55.5s/30m0s  32/50 shared iters

running (01m58.0s), 3/3 VUs, 32 complete and 0 interrupted iterations
ecg    [  64% ] 3 VUs  01m56.5s/30m0s  32/50 shared iters

running (01m59.0s), 3/3 VUs, 32 complete and 0 interrupted iterations
ecg    [  64% ] 3 VUs  01m57.5s/30m0s  32/50 shared iters

running (02m00.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
ecg    [  66% ] 3 VUs  01m58.5s/30m0s  33/50 shared iters

running (02m01.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
ecg    [  66% ] 3 VUs  01m59.5s/30m0s  33/50 shared iters

running (02m02.0s), 3/3 VUs, 34 complete and 0 interrupted iterations
ecg    [  68% ] 3 VUs  02m00.5s/30m0s  34/50 shared iters

running (02m03.0s), 3/3 VUs, 34 complete and 0 interrupted iterations
ecg    [  68% ] 3 VUs  02m01.5s/30m0s  34/50 shared iters

running (02m04.0s), 3/3 VUs, 34 complete and 0 interrupted iterations
ecg    [  68% ] 3 VUs  02m02.5s/30m0s  34/50 shared iters

running (02m05.0s), 3/3 VUs, 34 complete and 0 interrupted iterations
ecg    [  68% ] 3 VUs  02m03.5s/30m0s  34/50 shared iters

running (02m06.0s), 3/3 VUs, 35 complete and 0 interrupted iterations
ecg    [  70% ] 3 VUs  02m04.5s/30m0s  35/50 shared iters

running (02m07.0s), 3/3 VUs, 35 complete and 0 interrupted iterations
ecg    [  70% ] 3 VUs  02m05.5s/30m0s  35/50 shared iters

running (02m08.0s), 3/3 VUs, 35 complete and 0 interrupted iterations
ecg    [  70% ] 3 VUs  02m06.5s/30m0s  35/50 shared iters

running (02m09.0s), 3/3 VUs, 35 complete and 0 interrupted iterations
ecg    [  70% ] 3 VUs  02m07.5s/30m0s  35/50 shared iters

running (02m10.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
ecg    [  72% ] 3 VUs  02m08.5s/30m0s  36/50 shared iters

running (02m11.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
ecg    [  72% ] 3 VUs  02m09.5s/30m0s  36/50 shared iters

running (02m12.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
ecg    [  72% ] 3 VUs  02m10.5s/30m0s  36/50 shared iters

running (02m13.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
ecg    [  72% ] 3 VUs  02m11.5s/30m0s  36/50 shared iters

running (02m14.0s), 3/3 VUs, 37 complete and 0 interrupted iterations
ecg    [  74% ] 3 VUs  02m12.5s/30m0s  37/50 shared iters

running (02m15.0s), 3/3 VUs, 37 complete and 0 interrupted iterations
ecg    [  74% ] 3 VUs  02m13.5s/30m0s  37/50 shared iters

running (02m16.0s), 3/3 VUs, 38 complete and 0 interrupted iterations
ecg    [  76% ] 3 VUs  02m14.5s/30m0s  38/50 shared iters

running (02m17.0s), 3/3 VUs, 38 complete and 0 interrupted iterations
ecg    [  76% ] 3 VUs  02m15.5s/30m0s  38/50 shared iters

running (02m18.0s), 3/3 VUs, 38 complete and 0 interrupted iterations
ecg    [  76% ] 3 VUs  02m16.5s/30m0s  38/50 shared iters

running (02m19.0s), 3/3 VUs, 38 complete and 0 interrupted iterations
ecg    [  76% ] 3 VUs  02m17.5s/30m0s  38/50 shared iters

running (02m20.0s), 3/3 VUs, 38 complete and 0 interrupted iterations
ecg    [  76% ] 3 VUs  02m18.5s/30m0s  38/50 shared iters

running (02m21.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
ecg    [  78% ] 3 VUs  02m19.5s/30m0s  39/50 shared iters

running (02m22.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
ecg    [  78% ] 3 VUs  02m20.5s/30m0s  39/50 shared iters

running (02m23.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
ecg    [  78% ] 3 VUs  02m21.5s/30m0s  39/50 shared iters

running (02m24.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
ecg    [  78% ] 3 VUs  02m22.5s/30m0s  39/50 shared iters

running (02m25.0s), 3/3 VUs, 40 complete and 0 interrupted iterations
ecg    [  80% ] 3 VUs  02m23.5s/30m0s  40/50 shared iters

running (02m26.0s), 3/3 VUs, 40 complete and 0 interrupted iterations
ecg    [  80% ] 3 VUs  02m24.5s/30m0s  40/50 shared iters

running (02m27.0s), 3/3 VUs, 41 complete and 0 interrupted iterations
ecg    [  82% ] 3 VUs  02m25.5s/30m0s  41/50 shared iters

running (02m28.0s), 3/3 VUs, 41 complete and 0 interrupted iterations
ecg    [  82% ] 3 VUs  02m26.5s/30m0s  41/50 shared iters

running (02m29.0s), 3/3 VUs, 41 complete and 0 interrupted iterations
ecg    [  82% ] 3 VUs  02m27.5s/30m0s  41/50 shared iters

running (02m30.0s), 3/3 VUs, 41 complete and 0 interrupted iterations
ecg    [  82% ] 3 VUs  02m28.5s/30m0s  41/50 shared iters

running (02m31.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
ecg    [  84% ] 3 VUs  02m29.5s/30m0s  42/50 shared iters

running (02m32.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
ecg    [  84% ] 3 VUs  02m30.5s/30m0s  42/50 shared iters

running (02m33.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
ecg    [  84% ] 3 VUs  02m31.5s/30m0s  42/50 shared iters

running (02m34.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
ecg    [  84% ] 3 VUs  02m32.5s/30m0s  42/50 shared iters

running (02m35.0s), 3/3 VUs, 43 complete and 0 interrupted iterations
ecg    [  86% ] 3 VUs  02m33.5s/30m0s  43/50 shared iters

running (02m36.0s), 3/3 VUs, 43 complete and 0 interrupted iterations
ecg    [  86% ] 3 VUs  02m34.5s/30m0s  43/50 shared iters

running (02m37.0s), 3/3 VUs, 44 complete and 0 interrupted iterations
ecg    [  88% ] 3 VUs  02m35.5s/30m0s  44/50 shared iters

running (02m38.0s), 3/3 VUs, 44 complete and 0 interrupted iterations
ecg    [  88% ] 3 VUs  02m36.5s/30m0s  44/50 shared iters

running (02m39.0s), 3/3 VUs, 44 complete and 0 interrupted iterations
ecg    [  88% ] 3 VUs  02m37.5s/30m0s  44/50 shared iters

running (02m40.0s), 3/3 VUs, 44 complete and 0 interrupted iterations
ecg    [  88% ] 3 VUs  02m38.5s/30m0s  44/50 shared iters

running (02m41.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
ecg    [  90% ] 3 VUs  02m39.5s/30m0s  45/50 shared iters

running (02m42.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
ecg    [  90% ] 3 VUs  02m40.5s/30m0s  45/50 shared iters

running (02m43.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
ecg    [  90% ] 3 VUs  02m41.5s/30m0s  45/50 shared iters

running (02m44.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
ecg    [  90% ] 3 VUs  02m42.5s/30m0s  45/50 shared iters

running (02m45.0s), 3/3 VUs, 46 complete and 0 interrupted iterations
ecg    [  92% ] 3 VUs  02m43.5s/30m0s  46/50 shared iters

running (02m46.0s), 3/3 VUs, 46 complete and 0 interrupted iterations
ecg    [  92% ] 3 VUs  02m44.5s/30m0s  46/50 shared iters

running (02m47.0s), 3/3 VUs, 47 complete and 0 interrupted iterations
ecg    [  94% ] 3 VUs  02m45.5s/30m0s  47/50 shared iters

running (02m48.0s), 3/3 VUs, 47 complete and 0 interrupted iterations
ecg    [  94% ] 3 VUs  02m46.5s/30m0s  47/50 shared iters

running (02m49.0s), 3/3 VUs, 47 complete and 0 interrupted iterations
ecg    [  94% ] 3 VUs  02m47.5s/30m0s  47/50 shared iters

running (02m50.0s), 3/3 VUs, 47 complete and 0 interrupted iterations
ecg    [  94% ] 3 VUs  02m48.5s/30m0s  47/50 shared iters

running (02m51.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  02m49.5s/30m0s  48/50 shared iters

running (02m52.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  02m50.5s/30m0s  48/50 shared iters

running (02m53.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  02m51.5s/30m0s  48/50 shared iters

running (02m54.0s), 2/3 VUs, 48 complete and 0 interrupted iterations
ecg    [  96% ] 3 VUs  02m52.5s/30m0s  48/50 shared iters

running (02m55.0s), 1/3 VUs, 49 complete and 0 interrupted iterations
ecg    [  98% ] 3 VUs  02m53.5s/30m0s  49/50 shared iters

running (02m56.0s), 1/3 VUs, 49 complete and 0 interrupted iterations
ecg    [  98% ] 3 VUs  02m54.5s/30m0s  49/50 shared iters


  █ THRESHOLDS 

    ecg_duration
    ✓ 'p(95)<30000' p(95)=12.03s

    ecg_success
    ✓ 'rate>0.95' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 100     0.567763/s
    checks_succeeded...: 100.00% 100 out of 100
    checks_failed......: 0.00%   0 out of 100

    ✓ ecg completed
    ✓ ecg under 30s

    CUSTOM
    ecg_duration...................: avg=10.3s  min=10.02s med=10.02s max=16.05s   p(90)=10.23s p(95)=12.03s 
    ecg_success....................: 100.00% 50 out of 50

    HTTP
    http_req_duration..............: avg=9.66ms min=1.81ms med=4.21ms max=252.79ms p(90)=9.43ms p(95)=11.55ms
      { expected_response:true }...: avg=9.66ms min=1.81ms med=4.21ms max=252.79ms p(90)=9.43ms p(95)=11.55ms
    http_req_failed................: 0.00%   0 out of 313
    http_reqs......................: 313     1.777097/s

    EXECUTION
    iteration_duration.............: avg=10.31s min=10.02s med=10.03s max=16.07s   p(90)=10.25s p(95)=12.04s 
    iterations.....................: 50      0.283881/s
    vus............................: 1       min=0        max=3
    vus_max........................: 3       min=3        max=3

    NETWORK
    data_received..................: 557 kB  3.2 kB/s
    data_sent......................: 1.3 MB  7.3 kB/s



time="2026-06-17T07:47:18Z" level=error msg="failed to handle the end-of-test summary" error="Could not save some summary information:\n\t- could not open '/tests/results/20260617_104413_capacity_base_summary.json': open /tests/results/20260617_104413_capacity_base_summary.json: permission denied"

running (02m56.1s), 0/3 VUs, 50 complete and 0 interrupted iterations
ecg  ✓ [ 100% ] 3 VUs  02m54.7s/30m0s  50/50 shared iters